In [18]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.read_excel("Test_Merge.xlsx",sheet_name= "Df1")

In [3]:
df2 = pd.read_excel("Test_Merge.xlsx",sheet_name= "Df2")

In [4]:
df1

   C_Id     Name    City         Mob
0     1  shubham  nagpur  8983471527
1     2   nikita  nagpur  1234567891
2     3    rahul   surat     5555555
3     4  kanchan    pune     4631323
4     5    rajan   kochi         465

In [5]:
df2

   O_Id  C_Id       Product
0   101     2            TV
1   102     3        Fridge
2   103     4        Mobile
3   104     1           tab
4   105     1  Apple mobile
5   106     6       T-shirt

In [6]:
pd.merge(left=df1,right=df2,how='cross')

    C_Id_x     Name    City         Mob  O_Id  C_Id_y       Product
0        1  shubham  nagpur  8983471527   101       2            TV
1        1  shubham  nagpur  8983471527   102       3        Fridge
2        1  shubham  nagpur  8983471527   103       4        Mobile
3        1  shubham  nagpur  8983471527   104       1           tab
4        1  shubham  nagpur  8983471527   105       1  Apple mobile
5        1  shubham  nagpur  8983471527   106       6       T-shirt
6        2   nikita  nagpur  1234567891   101       2            TV
7        2   nikita  nagpur  1234567891   102       3        Fridge
8        2   nikita  nagpur  1234567891   103       4        Mobile
9        2   nikita  nagpur  1234567891   104       1           tab
10       2   nikita  nagpur  1234567891   105       1  Apple mobile
11       2   nikita  nagpur  1234567891   106       6       T-shirt
12       3    rahul   surat     5555555   101       2            TV
13       3    rahul   surat     5555555   102       3        Fridge
14       3    rahul   surat     5555555   103       4        Mobile
15       3    rahul   surat     5555555   104       1           tab
16       3    rahul   surat     5555555   105       1  Apple mobile
17       3    rahul   surat     5555555   106       6       T-shirt
18       4  kanchan    pune     4631323   101       2            TV
19       4  kanchan    pune     4631323   102       3        Fridge
20       4  kanchan    pune     4631323   103       4        Mobile
21       4  kanchan    pune     4631323   104       1           tab
22       4  kanchan    pune     4631323   105       1  Apple mobile
23       4  kanchan    pune     4631323   106       6       T-shirt
24       5    rajan   kochi         465   101       2            TV
25       5    rajan   kochi         465   102       3        Fridge
26       5    rajan   kochi         465   103       4        Mobile
27       5    rajan   kochi         465   104       1           tab
28       5    rajan   kochi         465   105       1  Apple mobile
29       5    rajan   kochi         465   106       6       T-shirt

In [7]:
pd.merge(df1,df2,how='inner',on='C_Id')

   C_Id     Name    City         Mob  O_Id       Product
0     1  shubham  nagpur  8983471527   104           tab
1     1  shubham  nagpur  8983471527   105  Apple mobile
2     2   nikita  nagpur  1234567891   101            TV
3     3    rahul   surat     5555555   102        Fridge
4     4  kanchan    pune     4631323   103        Mobile

In [8]:
pd.merge(df1,df2,how='left',on='C_Id')

   C_Id     Name    City         Mob   O_Id       Product
0     1  shubham  nagpur  8983471527  104.0           tab
1     1  shubham  nagpur  8983471527  105.0  Apple mobile
2     2   nikita  nagpur  1234567891  101.0            TV
3     3    rahul   surat     5555555  102.0        Fridge
4     4  kanchan    pune     4631323  103.0        Mobile
5     5    rajan   kochi         465    NaN           NaN

In [9]:
pd.merge(df1,df2,how='right',on='C_Id')

   C_Id     Name    City           Mob  O_Id       Product
0     2   nikita  nagpur  1.234568e+09   101            TV
1     3    rahul   surat  5.555555e+06   102        Fridge
2     4  kanchan    pune  4.631323e+06   103        Mobile
3     1  shubham  nagpur  8.983472e+09   104           tab
4     1  shubham  nagpur  8.983472e+09   105  Apple mobile
5     6      NaN     NaN           NaN   106       T-shirt

In [10]:
pd.merge(df1,df2,how='outer',on='C_Id')

   C_Id     Name    City           Mob   O_Id       Product
0     1  shubham  nagpur  8.983472e+09  104.0           tab
1     1  shubham  nagpur  8.983472e+09  105.0  Apple mobile
2     2   nikita  nagpur  1.234568e+09  101.0            TV
3     3    rahul   surat  5.555555e+06  102.0        Fridge
4     4  kanchan    pune  4.631323e+06  103.0        Mobile
5     5    rajan   kochi  4.650000e+02    NaN           NaN
6     6      NaN     NaN           NaN  106.0       T-shirt

In [15]:
df1['Mob'] = df1['Mob'].astype(str)

In [ ]:
state_dict={"Maharastra":['nagpur','pune'],"Gujrat":['surat'],"Kerala":['kochi']}

In [16]:
df1.dtypes

C_Id     int64
Name    object
City    object
Mob     object
dtype: object

In [22]:
np.where?

Call signature:  np.where(*args, **kwargs)
Type:            _ArrayFunctionDispatcher
String form:     <built-in function where>
Docstring:
where(condition, [x, y], /)

Return elements chosen from `x` or `y` depending on `condition`.

.. note::
    When only `condition` is provided, this function is a shorthand for
    ``np.asarray(condition).nonzero()``. Using `nonzero` directly should be
    preferred, as it behaves correctly for subclasses. The rest of this
    documentation covers only the case where all three arguments are
    provided.

Parameters
----------
condition : array_like, bool
    Where True, yield `x`, otherwise yield `y`.
x, y : array_like
    Values from which to choose. `x`, `y` and `condition` need to be
    broadcastable to some shape.

Returns
-------
out : ndarray
    An array with elements from `x` where `condition` is True, and elements
    from `y` elsewhere.

See Also
--------
choose
nonzero : The function that is called when x and y are omitted

Notes
-----
If all the arrays are 1-D, `where` is equivalent to::

    [xv if c else yv
     for c, xv, yv in zip(condition, x, y)]

Examples
--------
>>> a = np.arange(10)
>>> a
array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])
>>> np.where(a < 5, a, 10*a)
array([ 0,  1,  2,  3,  4, 50, 60, 70, 80, 90])

This can be used on multidimensional arrays too:

>>> np.where([[True, False], [True, True]],
...          [[1, 2], [3, 4]],
...          [[9, 8], [7, 6]])
array([[1, 8],
       [3, 4]])

The shapes of x, y, and the condition are broadcast together:

>>> x, y = np.ogrid[:3, :4]
>>> np.where(x < y, x, 10 + y)  # both x and 10+y are broadcast
array([[10,  0,  0,  0],
       [10, 11,  1,  1],
       [10, 11, 12,  2]])

>>> a = np.array([[0, 1, 2],
...               [0, 2, 4],
...               [0, 3, 6]])
>>> np.where(a < 4, a, -1)  # -1 is broadcast
array([[ 0,  1,  2],
       [ 0,  2, -1],
       [ 0,  3, -1]])
Class docstring:
Class to wrap functions with checks for __array_function__ overrides.

All arguments are required, and can only be passed by position.

Parameters
----------
dispatcher : function or None
    The dispatcher function that returns a single sequence-like object
    of all arguments relevant.  It must have the same signature (except
    the default values) as the actual implementation.
    If ``None``, this is a ``like=`` dispatcher and the
    ``_ArrayFunctionDispatcher`` must be called with ``like`` as the
    first (additional and positional) argument.
implementation : function
    Function that implements the operation on NumPy arrays without
    overrides.  Arguments passed calling the ``_ArrayFunctionDispatcher``
    will be forwarded to this (and the ``dispatcher``) as if using
    ``*args, **kwargs``.

Attributes
----------
_implementation : function
    The original implementation passed in.

In [25]:
df1['Mobile_status']=np.where(df1['Mob'].str.len()==10,'Valied','Invalied')

In [26]:
df1

   C_Id     Name    City         Mob Mobile_status
0     1  shubham  nagpur  8983471527        Valied
1     2   nikita  nagpur  1234567891        Valied
2     3    rahul   surat     5555555      Invalied
3     4  kanchan    pune     4631323      Invalied
4     5    rajan   kochi         465      Invalied

In [ ]:
assesser -- str,dt,cat